In [1]:
import os
import pandas as pd
import re

files = sorted(os.listdir("./data/census.gov"))
files

['ACSPUMS1Y2008_2025-04-19T08_36_35.770Z.csv',
 'ACSPUMS1Y2009_2025-04-19T08_36_17.781Z.csv',
 'ACSPUMS1Y2010_2025-04-19T08_36_09.922Z.csv',
 'ACSPUMS1Y2011_2025-04-19T08_36_01.516Z.csv',
 'ACSPUMS1Y2012_2025-04-19T08_35_50.027Z.csv',
 'ACSPUMS1Y2013_2025-04-19T08_35_36.252Z.csv',
 'ACSPUMS1Y2014_2025-04-19T08_35_19.143Z.csv',
 'ACSPUMS1Y2015_2025-04-19T08_32_56.671Z.csv',
 'ACSPUMS1Y2016_2025-04-19T08_32_43.800Z.csv',
 'ACSPUMS1Y2017_2025-04-19T08_32_33.424Z.csv',
 'ACSPUMS1Y2018_2025-04-19T08_31_49.310Z.csv',
 'ACSPUMS1Y2019_2025-04-19T08_31_34.148Z.csv',
 'ACSPUMS1Y2021_2025-04-19T08_31_15.576Z.csv',
 'ACSPUMS1Y2022_2025-04-19T08_31_06.069Z.csv',
 'ACSPUMS1Y2023_2025-04-19T08_30_55.187Z.csv']

In [2]:
df = pd.DataFrame(
    columns=[
        "Year",
        "Age",
        "Gender",
        "Educational Attainment",
        "Hispanic",
        "Race",
        "Personal Income",
        "Population Count",
    ]
)

In [3]:
def count_arrows(line):
    n = 0
    for i in range(len(line)):
        if line[i] == "-":
            if line[i + 1] == ">":
                n += 1
    return n


def cleanup(fn):
    with open("./data/census.gov/" + fn, "r") as fd:
        content = fd.readlines()
    year = re.search("(\d\d\d\d)", content[0]).groups()[0]
    content = content[11:]
    for line in content:
        ar = count_arrows(line)
        if ar == 5:
            parts = line.split("->")
            ag = parts[1].strip()
            gn = parts[2].strip()
            ed = parts[3].strip()
            hs = parts[4].strip()
            rc = parts[5].strip().split('"')[0]
        elif ar == 0:
            parts = line.split('"')
            pi = parts[3].strip()
            cn = parts[5].strip()
            df.loc[len(df)] = (year, ag, gn, ed, hs, rc, pi, cn)

In [4]:
for fn in files:
    print(fn)
    cleanup(fn)

ACSPUMS1Y2008_2025-04-19T08_36_35.770Z.csv
ACSPUMS1Y2009_2025-04-19T08_36_17.781Z.csv
ACSPUMS1Y2010_2025-04-19T08_36_09.922Z.csv
ACSPUMS1Y2011_2025-04-19T08_36_01.516Z.csv
ACSPUMS1Y2012_2025-04-19T08_35_50.027Z.csv
ACSPUMS1Y2013_2025-04-19T08_35_36.252Z.csv
ACSPUMS1Y2014_2025-04-19T08_35_19.143Z.csv
ACSPUMS1Y2015_2025-04-19T08_32_56.671Z.csv
ACSPUMS1Y2016_2025-04-19T08_32_43.800Z.csv
ACSPUMS1Y2017_2025-04-19T08_32_33.424Z.csv
ACSPUMS1Y2018_2025-04-19T08_31_49.310Z.csv
ACSPUMS1Y2019_2025-04-19T08_31_34.148Z.csv
ACSPUMS1Y2021_2025-04-19T08_31_15.576Z.csv
ACSPUMS1Y2022_2025-04-19T08_31_06.069Z.csv
ACSPUMS1Y2023_2025-04-19T08_30_55.187Z.csv

In [5]:
df.head()

,Year,Age,Gender,Educational Attainment,Hispanic,Race,Personal Income,Population Count
0,2008,00 to 17,Male,High school or equivalent,Hispanic,White,"$5,000 to $9,999",560
1,2008,00 to 17,Male,High school or equivalent,Hispanic,White,"$10,000 to $14,999",0
2,2008,00 to 17,Male,High school or equivalent,Hispanic,White,"$15,000 to $24,999",135
3,2008,00 to 17,Male,High school or equivalent,Hispanic,White,"$25,000 to $34,999",268
4,2008,00 to 17,Male,High school or equivalent,Hispanic,White,"$35,000 to $49,999",0

In [6]:
df.tail()

,Year,Age,Gender,Educational Attainment,Hispanic,Race,Personal Income,Population Count
23035,2023,65 to 80+,Female,No high school diploma,Not Hispanic,Other,"$25,000 to $34,999",863
23036,2023,65 to 80+,Female,No high school diploma,Not Hispanic,Other,"$35,000 to $49,999",748
23037,2023,65 to 80+,Female,No high school diploma,Not Hispanic,Other,"$50,000 to $74,999",288
23038,2023,65 to 80+,Female,No high school diploma,Not Hispanic,Other,"$75,000 and over",421
23039,2023,65 to 80+,Female,No high school diploma,Not Hispanic,Other,No Income,"1,123"

In [7]:
df["Population Count"] = df["Population Count"].astype(str).str.replace(",", "").astype(int)

In [8]:
for col in df.columns[:-1]:
    print(set(df[col].values))

{'2008', '2016', '2021', '2010', '2015', '2023', '2018', '2014', '2011', '2017', '2013', '2012', '2009', '2019', '2022'}
{'18 to 64', '65 to 80+', '00 to 17'}
{'Female', 'Male'}
{'High school or equivalent', 'Some college, less than 4-yr degree', "Bachelor's degree or higher", 'No high school diploma'}
{'Hispanic', 'Not Hispanic'}
{'African American', 'Asian', 'White', 'Other'}
{'$25,000 to $34,999', '$15,000 to $24,999', '$75,000 and over', 'No Income', '$50,000 to $74,999', '$10,000 to $14,999', '$35,000 to $49,999', '$5,000 to $9,999'}

In [9]:
aorder = ['00 to 17', '18 to 64', '65 to 80+']
gorder = ["Male", "Female"]
eorder = ['No high school diploma', 'High school or equivalent', 'Some college, less than 4-yr degree', "Bachelor's degree or higher"]
rorder = ["White", "African American", "Asian", "Hispanic", "Other"]
iorder = ['$5,000 to $9,999', '$10,000 to $14,999', '$15,000 to $24,999', '$25,000 to $34,999', '$35,000 to $49,999', '$50,000 to $74,999','$75,000 and over', "No Income"]

In [10]:
hispdf = (
    df[df["Hispanic"] == "Hispanic"]
    .drop(columns=['Race',"Hispanic"])
    .groupby(['Year', 'Age', 'Gender', 'Educational Attainment',  'Personal Income'])
    .sum()
    .reset_index()
    .copy()
)

hispdf["Race"] = "Hispanic"
hispdf = hispdf[['Year', 'Age', 'Gender', 'Educational Attainment', 'Race', 'Personal Income', 'Population Count']]
nohpdf = (
    df[df["Hispanic"] != "Hispanic"]
    .drop(columns=["Hispanic"])
    .groupby(['Year', 'Age', 'Gender', 'Educational Attainment',  'Race', 'Personal Income'])
    .sum()
    .reset_index()
    .copy()
)
display(hispdf.tail())
display(nohpdf.tail())

,Year,Age,Gender,Educational Attainment,Race,Personal Income,Population Count
2875,2023,65 to 80+,Male,"Some college, less than 4-yr degree",Hispanic,"$35,000 to $49,999",16333
2876,2023,65 to 80+,Male,"Some college, less than 4-yr degree",Hispanic,"$5,000 to $9,999",7124
2877,2023,65 to 80+,Male,"Some college, less than 4-yr degree",Hispanic,"$50,000 to $74,999",24011
2878,2023,65 to 80+,Male,"Some college, less than 4-yr degree",Hispanic,"$75,000 and over",22121
2879,2023,65 to 80+,Male,"Some college, less than 4-yr degree",Hispanic,No Income,5890

,Year,Age,Gender,Educational Attainment,Race,Personal Income,Population Count
11515,2023,65 to 80+,Male,"Some college, less than 4-yr degree",White,"$35,000 to $49,999",66465
11516,2023,65 to 80+,Male,"Some college, less than 4-yr degree",White,"$5,000 to $9,999",13904
11517,2023,65 to 80+,Male,"Some college, less than 4-yr degree",White,"$50,000 to $74,999",84077
11518,2023,65 to 80+,Male,"Some college, less than 4-yr degree",White,"$75,000 and over",98172
11519,2023,65 to 80+,Male,"Some college, less than 4-yr degree",White,No Income,13530

In [11]:
combdf = pd.concat([hispdf, nohpdf], ignore_index=True)
combdf.head()

,Year,Age,Gender,Educational Attainment,Race,Personal Income,Population Count
0,2008,00 to 17,Female,Bachelor's degree or higher,Hispanic,"$10,000 to $14,999",0
1,2008,00 to 17,Female,Bachelor's degree or higher,Hispanic,"$15,000 to $24,999",0
2,2008,00 to 17,Female,Bachelor's degree or higher,Hispanic,"$25,000 to $34,999",0
3,2008,00 to 17,Female,Bachelor's degree or higher,Hispanic,"$35,000 to $49,999",0
4,2008,00 to 17,Female,Bachelor's degree or higher,Hispanic,"$5,000 to $9,999",0

In [12]:
combdf["Year"] = combdf["Year"].astype(int)
combdf["Age"] = pd.Categorical(combdf["Age"], categories=aorder, ordered=True)
combdf["Gender"] = pd.Categorical(combdf["Gender"], categories=gorder, ordered=True)
combdf["Educational Attainment"] = pd.Categorical(combdf["Educational Attainment"], categories=eorder, ordered=True)
combdf["Race"] = pd.Categorical(combdf["Race"], categories=rorder, ordered=True)
combdf["Personal Income"] = pd.Categorical(combdf["Personal Income"], categories=iorder, ordered=True)

combdf = combdf.sort_values(by=["Year", "Age", "Gender", "Educational Attainment", "Race", "Personal Income"]).reset_index(drop=True)
combdf.head()

,Year,Age,Gender,Educational Attainment,Race,Personal Income,Population Count
0,2008,00 to 17,Male,No high school diploma,White,"$5,000 to $9,999",9869
1,2008,00 to 17,Male,No high school diploma,White,"$10,000 to $14,999",3191
2,2008,00 to 17,Male,No high school diploma,White,"$15,000 to $24,999",1642
3,2008,00 to 17,Male,No high school diploma,White,"$25,000 to $34,999",332
4,2008,00 to 17,Male,No high school diploma,White,"$35,000 to $49,999",135

In [13]:
# 2020 is missing, so using avg of 2019 and 2021 to interpolate
df19 = combdf[combdf["Year"] == 2019].reset_index(drop=True)
df21 = combdf[combdf["Year"] == 2021].reset_index(drop=True)
df20 = pd.DataFrame(columns=["Year", "Age", "Gender", "Educational Attainment", "Race", "Personal Income", "Population Count"])
for i, row in df19.iterrows():
    df20.loc[len(df20)] = [
        2020, 
        row["Age"], 
        row["Gender"], 
        row["Educational Attainment"], 
        row["Race"], 
        row["Personal Income"], 
        (row["Population Count"] + df21.loc[i, "Population Count"]) // 2,
    ]

In [14]:
combdf2 = pd.concat([combdf, df20], ignore_index=True)
combdf2["Year"] = combdf2["Year"].astype(int)
combdf2["Age"] = pd.Categorical(combdf2["Age"], categories=aorder, ordered=True)
combdf2["Gender"] = pd.Categorical(combdf2["Gender"], categories=gorder, ordered=True)
combdf2["Educational Attainment"] = pd.Categorical(combdf2["Educational Attainment"], categories=eorder, ordered=True)
combdf2["Race"] = pd.Categorical(combdf2["Race"], categories=rorder, ordered=True)
combdf2["Personal Income"] = pd.Categorical(combdf2["Personal Income"], categories=iorder, ordered=True)
combdf2 = combdf2.sort_values(by=["Year", "Age", "Gender", "Educational Attainment", "Race", "Personal Income"]).reset_index(drop=True)
combdf2.head()

,Year,Age,Gender,Educational Attainment,Race,Personal Income,Population Count
0,2008,00 to 17,Male,No high school diploma,White,"$5,000 to $9,999",9869
1,2008,00 to 17,Male,No high school diploma,White,"$10,000 to $14,999",3191
2,2008,00 to 17,Male,No high school diploma,White,"$15,000 to $24,999",1642
3,2008,00 to 17,Male,No high school diploma,White,"$25,000 to $34,999",332
4,2008,00 to 17,Male,No high school diploma,White,"$35,000 to $49,999",135

In [15]:
combdf2.to_csv("./data/in/data.gov_personal_income.csv", index=False)
combdf2.to_csv("./data/out/data.gov_personal_income.csv", index=False)